'''
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
'''

# Решение через списки
month = int(input("Введите номер месяца от 1 до 12: "))
month_year = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль",
              "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
month_str = month_year[month - 1]
month_season = [["декабрь", "январь", "февраль"], ["март", "апрель", "май"],
                ["июнь", "июль", "август"], ["сентябрь", "октябрь", "ноябрь"]]
month_season_ru = ["Зима", "Весна", "Лето", "Осень"]
for row in range(0, len(month_season)):
    for element in month_season[row]:
        if element == month_str:
            ind = row
            print(f"{month} месяц ({month_str}) - {month_season_ru[ind]}")

# Решение через словари
season = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето",
          7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень",
          12: "Зима"}
print(f"{month} месяц - {season[month]}")
